#include "header.h"
using namespace std;

int main()
{
	setlocale(LC_ALL, "russian");
	cout << "====================================================================="
		<< "\nУПОРЯДКОВАНА ПОСЛIДОВНIСТЬ ЕЛЕМЕНТIВ\n"
		<< "=====================================================================";
	SortAll(1);

	cout << "====================================================================="
		<< "\nЗВОРОТНО УПОРЯДКОВАНА ПОСЛIДОВНIСТЬ ЕЛЕМЕНТIВ\n"
		<< "=====================================================================";
	SortAll(2);

	cout << "====================================================================="
		<< "\nВИПАДКОВА ПОСЛIДОВНIСТЬ ЕЛЕМЕНТIВ\n"
		<< "=====================================================================";
	SortAll(3);

	cout << endl;
	system("pause");
	return 0;
}
