#include "header.h"
using namespace std;

int main()
{
	setlocale(LC_ALL, "russian");
	cout << "====================================================================="
		<< "\nУПОРЯДКОВАНА ПОСЛIДОВНIСТЬ ЕЛЕМЕНТIВ\n"
		<< "=====================================================================";
	SortAndOutput100(1);

	cout << "\n====================================================================="
		<< "\nЗВОРОТНЬО УПОРЯДКОВАНА ПОСЛIДОВНIСТЬ ЕЛЕМЕНТIВ\n"
		<< "=====================================================================";
	SortAndOutput100(2);

	cout << "\n====================================================================="
		<< "\nВИПАДКОВА ПОСЛIДОВНIСТЬ ЕЛЕМЕНТIВ\n"
		<< "=====================================================================";
	SortAndOutput100(3);

	cout << endl;
	system("pause");
	return 0;
}
